#!/usr/bin/python3

"""
Уникализируйте список и выведите количество рыб, затем каждую рыбу на отдельной строке.
Вот так:

Всего 3 видов рыб
сельдь-черноспинка
морская камбала
тунец
"""

# Задача
"""
raw_list = ["сельдь-черноспинка", "морская камбала", "тунец", "ставрида", "морской окунь", "треска", "сайра",
"морская камбала", "ставрида", "треска", "треска", "треска", "тунец", "ставрида", "морская камбала",
"тунец", "морская камбала", "морская камбала", "морская камбала", "морская камбала", "тунец",
           ]
unique_list = []
print(f"Всего X видов рыб")
"""

# Решение
raw_list = ["сельдь-черноспинка", "морская камбала", "тунец", "ставрида", "морской окунь", "треска", "сайра",
            "морская камбала", "ставрида", "треска", "треска", "треска", "тунец", "ставрида", "морская камбала",
            "тунец", "морская камбала", "морская камбала", "морская камбала", "морская камбала", "тунец",
            ]


def get_unique_fish(list_: list[str]) -> str:
    processed_list = sorted(list(set(list_)))
    return (f"Всего {len(processed_list)} видов рыб\n"
            f"{'\n'.join(processed_list)}")


print(get_unique_fish(raw_list))
