#!/usr/bin/python3

"""
Напишите простейший метод инициализации, который говорит: «Я инициализировался!»
"""

# Задача
"""
class Hero:

  def __...__(...):
    ...


# Не удаляйте код ниже, это проверка (иначе мы укусим вас за бочок)

print("Проверка:")
pythomir = Hero()
"""


# Решение
class Hero:

    def __init__(self):
        print("Я инициализировался!")


# Не удаляйте код ниже, это проверка (иначе мы укусим вас за бочок)

print("Проверка:")
pythomir = Hero()
